use crossterm::style::{Color, Stylize};

pub fn banner() -> () {
    let banner = r#"

    ░       ░░░  ░░░░  ░░░      ░░░        ░░  ░░░░  ░░░      ░░░       ░░
    ▒  ▒▒▒▒  ▒▒  ▒▒▒▒  ▒▒  ▒▒▒▒▒▒▒▒▒▒▒  ▒▒▒▒▒   ▒▒   ▒▒  ▒▒▒▒  ▒▒  ▒▒▒▒  ▒
    ▓       ▓▓▓  ▓▓▓▓  ▓▓▓      ▓▓▓▓▓▓  ▓▓▓▓▓        ▓▓  ▓▓▓▓  ▓▓       ▓▓
    █  ███  ███  ████  ████████  █████  █████  █  █  ██        ██  ███████
    █  ████  ███      ████      ██████  █████  ████  ██  ████  ██  ███████
    "#;

    println!("{}", banner.with(Color::DarkRed).bold());
    println!(
        "{}",
        "        A minimalist port scanner written in Rust 🦀".with(Color::DarkGrey)
    );
    println!(
        "{}",
        "        Github: https://github.com/Sebastian2dex/rustmap\n".with(Color::DarkGrey)
    );
}
